app/Views/keuangan/dashboard_k.php

SELECT `modal_awal`
FROM `tb_keuangan`
ORDER BY `tanggal` DESC
 LIMIT 1
---
                                            <?php
                                                // Ambil nilai modal awal dari tabel tb_keuangan
                                                $keuanganModel = new \App\Models\KeuanganModel(); // Sesuaikan dengan namespace model Anda
                                                $modalAwalValue = $keuanganModel->select('modal_awal')->orderBy('tanggal', 'DESC')->first()['modal_awal'];