app/Controllers/Home.php

SELECT `modal_awal`
FROM `tb_keuangan`
ORDER BY `tanggal` DESC
 LIMIT 1
---
    public function dashboard_k()
    {
        $session_lg = session();
        $pendapatanModel = new PendapatanModel();
        $pengeluaranModel = new PengeluaranModel();
        $keuanganModel = new KeuanganModel();

        $modalAwalRow = $keuanganModel->select('modal_awal')->orderBy('tanggal', 'DESC')->first();

SELECT *
FROM `user`
WHERE `id_user` = 'hr001'
 LIMIT 1
---
    public function validasi()
{
    helper(['form']);
    $session_lg = session();
    $val_user = new UserModel();

    $id_user = $this->request->getVar('id_user');
    $password = $this->request->getVar('password');
    $bagian = $this->request->getVar('bagian');

    // Mengambil data pengguna berdasarkan id_user
    $data = $val_user->where('id_user', $id_user)->first();