app/Models/GajiModel.php

SELECT *
FROM `tb_permintaan`
JOIN `tb_penggajian` ON `tb_permintaan`.`kd_gaji`=`tb_penggajian`.`kd_gaji`
JOIN `user` ON `tb_permintaan`.`id_user`=`user`.`id_user`
---
    public function getAll()
    {
        return $this->db->table($this->table)
        ->select('*')
        ->join('tb_penggajian', 'tb_permintaan.kd_gaji=tb_penggajian.kd_gaji')
        ->join('user', 'tb_permintaan.id_user=user.id_user')
        ->get()->getResult();