app/Models/PendapatanModel.php

    public function getTotalPendapatanBulanIni()
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->selectSum('nominal');
        $builder->where('MONTH(tanggal)', date('m'));
        $builder->where('YEAR(tanggal)', date('Y'));
        $query = $builder->get();
---
SELECT SUM(`nominal`) AS `nominal`
FROM `tb_pendapatan`
WHERE MONTH(tanggal) = '07'
AND YEAR(tanggal) = '2024'